package com.example.shayri_app;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import androidx.appcompat.app.AppCompatActivity;

import com.example.shayri_app.adapters.MyAdapter;

public class MainActivity extends AppCompatActivity {

    ListView listView1;


    int img[] = {R.drawable.bearbar,R.drawable.bestwishesh,R.drawable.married,
            R.drawable.birthday,R.drawable.boyfriendgirl,R.drawable.child,
            R.drawable.god,R.drawable.husband,R.drawable.kanjoos,R.drawable.love};
    String s1[] = {"शुभकामनाए शायरी","दोस्ती शायरी","मजेदार शायरी","भगवन शायरी","प्रेरणा स्त्रोत शायरी","जीवन शायरी","मुहब्बत शायरी","प्रेम शायरी","दर्द शायरी","बेवफा शायरी"};

    String[] shubhkamna = {"उदास हूँ पर, तुझसे नाराज नही\n" +
            "तेरे दिल मे हूँ पर तेरे पास नही।",
            "कितनी वाकिफ़ थी वो मेरी मोहब्बत से\n" +
                    "वो रो देती थी और मैं हार जाता था।"
            ,"कोई तीर होता तो, दाग़ देते तेरे दिल पर,\n" +
            "कम्भख्त मोहब्बत है, जताई भी नहीं जाती!!","रिश्ता बनाया है तो निभायेंगे,\n" +
            "हर वक्त तुमसे लड़ेंगे और तुम्हे मनायेंगे!","मेरी कब्र की मचान पर आईना लगा देना,\n" +
            "उसे देखने की आखरी उम्मीद बाकी हैं…,","जिद में आकर उनसे ताल्लुक तोड़ लिया हमने,\n" +
            "अब सुकून उनको नहीं और बेकरार हम भी हैं।","नींद चुराने वाले पूछते हैं सोते क्यों नही,\n" +
            "इतनी ही फिक्र है तो फिर हमारे होते क्यों नही।","गिरना था जो आपको तो सौ मक़ाम थे,\n" +
            "ये क्या किया कि निगाहों से गिर गए।","याद रखना ही मोहब्बत में नहीं है सब कुछ,\n" +
            "भूल जाना भी बड़ी बात हुआ करती है।","जो इंसान आपको खुश रख सकता है,\n" +
            "उससे ज्यादा परफैक्ट आपके लिए कोई नहीं हो सकता!"};

    String[] dosti = {"कद बढ़ा नहीं करते, ऐड़ियां उठाने से\n" +
            "ऊंचाईया तो मिलती हैं, सर झुकाने से।","दुनिया फ़रेब करके हुनरमंद हो गई,\n" +
            "हम ऐतबार करके गुनाहगार हो गए।","रहते हैं आस-पास ही लेकिन साथ नहीं होते…\n" +
            "कुछ लोग जलते हैं मुझसे बस खाक नहीं होते।","नजरों में दोस्तों की जो इतना खराब है,\n" +
            "उसका कसूर ये है कि वो कामयाब है।","देख कर उसको तेरा यूँ पलट जाना,…..\n" +
            "नफरत बता रही है तूने मोहब्बत गज़ब की थी।","एहसास-ऐ-मोहब्बत के लिए बस इतना ही काफी है,\n" +
            "तेरे बगैर भी हम तेरे ही रहते है।","हम उस तकदीर के सबसे पसंदीदा खिलौना हैं,\n" +
            "वो रोज़ जोड़ती है मुझे फिर से तोड़ने के लिए।","हुआ सवेरा तो हम उनके नाम तक भूल गए\n" +
            "जो बुझ गए रात में चरागों की लौ बढ़ाते हुए।","जिन जख्मो से खून नहीं निकलता समझ लेना\n" +
            "वो ज़ख्म किसी अपने ने ही दिया है।","दुनिया फ़रेब करके हुनरमंद हो गई,\n" +
            "हम ऐतबार करके गुनाहगार हो गए।"};
    String[] majedar = {"नींद चुराने वाले पूछते हैं सोते क्यू नही….!!!\n" +
            "इतनी ही फिक्र है तो फिर हमारे होते क्यू नही","मिलने को तो हर शख्स एहतराम से मिला,\n" +
            "पर जो मिला किसी न किसी काम से मिला।","जानते हो मोहब्बत किसे कहते है,\n" +
            "किसी को दिल से चाहना, उसे हार जाना,\n" +
            "और फिर खामोश हो जाना।","कोई अपना रिस्ता पुछे तो बता देना,\n" +
            "दो दिलो में एक जान बसती है हमारी।","यूँ सामने आकर आप बेठा न कीजिये,\n" +
            "ये सबर हर बार नहीं होता जनाब!","ये जो मेरे अलावा तुम पर मरते है\n" +
            "वो मर क्यों नहीं जाते!","ये ज़रूरी नहीं है की हर बात पर तुम मेरा कहा मानो,\n" +
            "दहलीज पर रख दी है चाहत और अब आगे तुम जानो।","मेरी सांसो पर नाम बस तुम्हारा है…\n" +
            "मैं अगर खुश हूं तो ये एहसान तुम्हारा है।","टपकती है निगाहों से… झलकती है अदाओं से,\n" +
            "मोहब्बत कौन कहता है की पहचानी नहीं जाती","मेरी हसरतों को इतना भी कैद में ना रख ए – जिन्दगी !\n" +
            "ये दिल भी थक चुका है इसकी ज़ामानत कराते कराते !"};
    String[] bhagvan = {"मुझे तेरा साथ…जिंदगी भर नहीं चाहिये,\n" +
            "बल्कि जब तक तु साथ है…तब तक जिंदगी चाहिये.","नहीं है अब कोई जुस्तजू इस दिल में ए सनम,\n" +
            "मेरी पहली और आखिरी आरज़ू बस तुम हो।","तुम्हें यकीन न हो हम पर तो बिछड़ कर देख लो,\n" +
            "तुम मिलोगे सबसे, मगर हमारी ही तलाश में।","इश्क का कोई रंग नहीं फिर भी वो रंगीन है,\n" +
            "मोहब्बत का कोई चेहरा नहीं फिर भी वो हसीन है।","कर दे नजर-ए-करम मुझपर मैं तुझ पर एतबार कर लूँ,\n" +
            "दीवाना हूं मैं तेरा ऐसा कि दीवानगी की हद पार कर लूं।","नहीं बस्ती किसी और की सूरत अब इन आँखों में,\n" +
            "काश की हमने तुझे इतने गौर से ना देखा होता ..","दिखने में वो बहुत गरीब थी साहब पर..\n" +
            "उसकी हँसी किसी शहजादी से कम नहीं थी।","जागना भी कबूल है तेरी यादो में रात भर,\n" +
            "तेरे एहसासों में जो मज़ा है वो नींद में कहा!!","में नासमझ सही पर वो तारा हूँ\n" +
            "जो तेरी ख्वाइशों के लिए सौ बार टूट जाऊ","तेरे इश्क़ में में इस तरह नीलाम हो जाऊ….\n" +
            "आख़री हो तेरी बोली और में तेरे नाम हो जाऊ"};
    String[] prerna = {"कितनी खूबसूरत हो जाती है दुनिया जब कोई अपना कहता है\n" +
            "के तुम बहुत याद आ रहे हो","एक दिल , एक जिस्म एक मैं,\n" +
            "एक तू यही ख्वाब है मेरा","हिंदी शायरी दो लाइन love\n" +
            "जिसे सोच कर ही चहरे पर ख़ुशी आ जाये,\n" +
            "वो खूबसूरत एहसास हो तुम","इज़्हार-ए-इश्क़ की ख़ातिर कई अल्फ़ाज़ सोचे थे,\n" +
            "ख़ुद ही को भूल बैठे हम, जब तुम सामने आये!!","क्या खूब रंग दिखाती है जिंदगी क्या इक्तेफ़ाक होता है,\n" +
            "प्यार में ऊम्र नही होती पर…. हर ऊम्र में प्यार होता है |","ऐ सनम… होगी कितनी चाहत उस दिल में,\n" +
            "जो खुद ही मान जाये कुछ पल खफा होने के बाद।","किसी से प्यार करो तो इतना करो कि वो,\n" +
            "आपको छोड़ के जाए तो किसी का हो न पाए।","भूल जाता हूँ मैं सब कुछ आपके सिवा, यह क्या मुझे हुआ है,\n" +
            "क्या इसी एहसास को दुनिया ने इश्क़ का नाम दिया है।","कितना हसीन इत्तेफाक़ था तेरी गली में आने का,\n" +
            "किसी काम से आये थे… किसी काम के ना रहे।","बिन दिल के जज्बात अधूरे, बिन धड़कन अहसास अधूरे,\n" +
            "बिन साँसों के ख्वाब अधूरे, बिन तेरे हम कब हैं पूरे।"};
    String[] jivan = {"अश्कों से भीगे पन्ने पर यूँ लफ्ज़ सिमटते गए,\n" +
            "दर्द से बेहाल कलम और ज़ज़्बात पिघलते गए।","हमें तो कबूल है हर दर्द… हर तकलीफ़ तेरी चाहत में,\n" +
            "बस इतना बता दे क्या तुझे मेरी मोहब्बत क़बूल है ?","कितनी वाकिफ़ थी वो मेरी मोहब्बत से\n" +
            "वो रो देती थी और मैं हार जाता था।","दिल की धड़कन बन कर दिल मे रहोगे तुम\n" +
            "जब तक सांस है तब तक मेरे साथ रहोगे तुम।","कहीं हर ज़िद पूरी, कहीं ज़रूरत भी अधूरी,\n" +
            "कहीं सुगंध भी नही, कहीं पूरा जीवन कस्तुरी।","अपनी कलम से दिल से दिल तक की बात करते हो\n" +
            "सीधे सीधे कह क्यों नहीं देते हम से #प्यार करते हो।","जब मैने उनसे कहा कि तुम पर प्यार आता है,\n" +
            "तो वो मुस्करा कर बोली तुम्हे और आता ही क्या है","चलो मर जाते है तुम पर,\n" +
            "बताओ दफ़्नाओगे अपने सीने मै","कैसे कह दू इश्क़ नहीं है तुमसे,\n" +
            "मेरे लिए इश्क़ का मतलब ही तुम हो","मुझे तू चाहिए तेरा साथ चाहिए,\n" +
            "जिसे थाम कर मै पूरी ज़िंदगी बिता दू…\n" +
            "वो वाला हाथ चाहिए"};
    String[] muhobbat = {"वो लड़ कर भी सो जाए तोह उसका माथा चूम लू\n" +
            "उस से झगड़ा एक तरफ और मोह्हबत एक तरफ","कोई अजनबी ख़ास हो रहा है……\n" +
            "लगता है मोहब्बतें एहसास हो रहा है","तलब ये के तुम मिल जाओ….\n" +
            "हसरत ये के उम्र भर के लिए","बस यही एक झिझक है हाले दिल सुनाने में,\n" +
            "के तेरा भी ज़िक्र आयेगा इस फसाने में","मिलावट है तेरे इश्क में इतर और शराब की,\n" +
            "कभी हम महेक जाते है कभी हम बहेक जाते हैं","मरना भी मुश्किल है जिस शख्श के वगैर,\n" +
            "उस शख्स ने ख्वाबों में भी आना छोड़ दिया।","हमें सीने से लगाकर हमारी सारी कसक दूर कर दो,\n" +
            "हम सिर्फ तुम्हारे हो जाऐ हमें इतना मजबूर कर दो।","जिसको दुआओं में मांगा तू है वही\n" +
            "रहनुमा तेरे बिना है मुश्किल एक भी कदम चलना।","दुनिया मे मोहब्बत आज भी बरकरार है..\n" +
            "क्योंकि एकतरफा प्यार अब भी वफादार है।","मेरी मोहब्बत थी यह या फिर दीवानगी की इन्तहा,\n" +
            "कि तेरे ही पास से गुज़र गया तेरे ही ख्याल से।"};
    String[] prem = {"मैंने तो देखा था बस एक नजर के खातिर,\n" +
            "क्या खबर थी की रग-रग में समां जाओगे तुम।","कमाल की चीज है ये मोहब्बत अधूरी हो सकती है,\n" +
            "पर कभी खत्म नही हो सकती।","अगर तू इश्क़ है तो\n" +
            "मेरी रूह मे उतर कर दिखा।","यूँ पलके बिछा कर तेरा इंतज़ार करते है ……\n" +
            "यह वो गुनाह है जो हम बार बार करते है …!!","तेरी दिलजारी का अंदाज भी गजब था,\n" +
            "अपना कभी बनाया नहीं,गैरो का होने ना दिया..","तमाम उम्र गुजार देगें हम राह-ए-इंतजार में,\n" +
            "झूठा ही सही पर आने का एक वादा तो कर दे।","ऐसा नही की आपकी याद आती नही,\n" +
            "ख़ता सिर्फ़ इतनी है के हम बताते नही !","कोई पूछेगा तो सुबह का भूला कह देंगे,,\n" +
            "तुम आओ तो सही,हम शाम को सवेरा कह देंगे..","दुनिया मे मोहब्बत आज भी बरकरार है,\n" +
            "क्योंकि एकतरफा प्यार अब भी वफादार है..","ये मत सोचना कि तुम्हारे बिना मर जायेंगे हम,\n" +
            "वो लोग भी जी रहे हैं जिन्हें छोड़ा था मैंने तुम्हारी खातिर.."};
    String[] dard = {"चाहत इतनी रखो की जी सभल जाए , अब\n" +
            "इस कदर भी ना चाहो कि दम निकल जाये।","मेरी मासूम सी मुहब्बत को ये हसीं तोहफे दे गए हैं,\n" +
            "जिंदगी बन कर आए थे.. और जिंदगी ले गए हैं!","शायद इश्क अब उतर रहा है सर से,\n" +
            "मुझे अलफ़ाज़ नहीं मिलते शायरी के लिए..","कैसे बयान करें सादगी अपने महबूब की,\n" +
            "पर्दा हमीं से था मगर नजर भी हमीं पे थी।","ज़ुल्फों को उंगलियों से किनारे किया ना कर\n" +
            "दिल मेरा आवारा है इसे और बिगाड़ा ना कर।","हमनें हाथ फैला कर इश्क मांगा था,\n" +
            "सनम ने हाथ चूमकर जान निकाल दी..","मेरे होंठो पर लफ्ज़ भी अब तेरी तलब लेकर आते हैं,\n" +
            "तेरे जिक्र से महकते हैं तेरे सजदे में बिखर जाते हैं।","है इश्क तो फिर असर भी होगा,\n" +
            "जितना है इधर , उधर भी होगा..","वो आँखों ही आँखों में करती है ऐसे बातें,\n" +
            "के कानों कान किसी को खबर नही होती।","वो पिला कर जाम होंठो से अपनी मोहब्बत का,\n" +
            "अब कहते हैं नशे की आदत अच्छी नहीं होती।"};
    String[] bewafa = {"शिकायत नहीं है रात से बस तुम्ही से कुछ कहना है,\n" +
            "बस तुम थोड़ा ठहर जाओ रात कब ठहरती है।","दूर होकर भी जो शख्स समाया है मेरी रूह में,\n" +
            "पास वालों पर वो कितना असर रखता होगा।","इश्क-ऐ-दरिया में हम डूब कर भी देख आये,\n" +
            "वो लोग मुनाफे में रहे जो किनारे से लौट आये","सामने बैठे रहो दिल को करार आएगा ,\n" +
            "जितना देखेंगे तुम्हे उतना ही प्यार आएगा ..","तुम्हारी फिक्र है मुझे इसमे कोई शक नही,\n" +
            "तुम्हे कोई और देखे किसी को ये हक नही।","उदास हूँ पर, तुझसे नाराज नही\n" +
            "तेरे दिल मे हूँ पर तेरे पास नही।","मत देखो हमें… तुम इस कदर,\n" +
            "इश्क़ तुम कर बैठोगे और इलज़ाम हमपर आयेगा।","कोई तीर होता तो, दाग़ देते तेरे दिल पर,\n" +
            "कम्भख्त मोहब्बत है, जताई भी नहीं जाती!!","अगर तुम्हें याद करने का कोई मीटर होता\n" +
            "तो सबसे ज्यादा बिल हमारा ही आता।","रिश्ता बनाया है तो निभायेंगे,\n" +
            "हर वक्त तुमसे लड़ेंगे और तुम्हे मनायेंगे!"};
    MyAdapter myadapter;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        listView1 = findViewById(R.id.listview1);
        myadapter = new MyAdapter(MainActivity.this,img,s1);
        listView1.setAdapter(myadapter);


        listView1.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                Intent intent = new Intent(MainActivity.this, com.example.shayri_app.list_second_page.class);
                if(position==0){
                    intent.putExtra("shayri",shubhkamna);
                } else if(position==1){
                    intent.putExtra("shayri",dosti);
                }else if(position==2){
                    intent.putExtra("shayri",majedar);
                }else if(position==3){
                    intent.putExtra("shayri",bhagvan);
                }else if(position==4){
                    intent.putExtra("shayri",prerna);
                }else if(position==5){
                    intent.putExtra("shayri",jivan);
                }else if(position==6){
                    intent.putExtra("shayri",muhobbat);
                }else if(position==7){
                    intent.putExtra("shayri",prem);
                }else if(position==8){
                    intent.putExtra("shayri",dard);
                }else if(position==9){
                    intent.putExtra("shayri",bewafa);
                }
                intent.putExtra("img",img[position]);
                startActivity(intent);
            }
        });

    }
}